HW2/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')  ORDER BY release_date
---
    def index

      @all_ratings = Movie.ratings_list

      # RATINGS CONTROLLER
      if params[:ratings]
        @ticked_ratings = params[:ratings].keys

        if @ticked_ratings != session[:ratings]
          session[:ratings] = @ticked_ratings
        end
        @movies = Movie.where('rating in (?)', @ticked_ratings)